cf_billing/DataProcessors/бестРаботаСНапоминаниямиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бестРаботаСНапоминаниямиПользователей</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf_billing/InformationRegisters/бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорам</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БазаРасчетаОбъема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестКоличествоПериодовДляРасчетаАванса</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БазаРасчетаСуммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестКоличествоПериодовДляРасчетаАванса</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестВидыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДеньФормирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргРолиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргРолиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргРоли</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/DataProcessors/бестРаботаСНапоминаниямиПользователей/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура СозданиеНапоминаний(Организация, РольПользователя, ТекстНапоминания, ЗаСколькоДней, Район = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.Организация КАК Организация,
		|	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.Район КАК Район,
		|	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.СрокОплаты КАК СрокОплаты
		|ПОМЕСТИТЬ СрокиОплаты
		|ИЗ
		|	РегистрСведений.бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорам.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И Район = &Район
		|				И СрокОплаты > 0) КАК бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргРолиПользователей.Пользователь КАК Пользователь,
		|	энргРолиПользователей.Организация КАК Организация,
		|	энргРолиПользователей.Район КАК Район,
		|	энргРолиПользователей.Роль КАК Роль
		|ПОМЕСТИТЬ РолиПользователей
		|ИЗ
		|	РегистрСведений.энргРолиПользователей КАК энргРолиПользователей
		|ГДЕ
		|	энргРолиПользователей.Организация = &Организация
		|	И энргРолиПользователей.Район = &Район
		|	И энргРолиПользователей.Роль = &РольПользователя
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РолиПользователей.Пользователь КАК Пользователь,
		|	РолиПользователей.Организация КАК Организация,
		|	РолиПользователей.Район КАК Район,
		|	РолиПользователей.Роль КАК Роль,
		|	СрокиОплаты.СрокОплаты КАК СрокОплаты,
		|	ЕСТЬNULL(энргЗадачаПИД.Ссылка, ЗНАЧЕНИЕ(Задача.энргЗадачаПИД.пустаяссылка)) КАК ЗадачаИсточник,
		|	ВЫБОР
		|		КОГДА ДЕНЬ(&ТекДата) < СрокиОплаты.СрокОплаты - &ЗаСколькоДней
		|			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекДата, МЕСЯЦ), ДЕНЬ, СрокиОплаты.СрокОплаты - 1 - &ЗаСколькоДней)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекДата, МЕСЯЦ), ДЕНЬ, СрокиОплаты.СрокОплаты - 1 - &ЗаСколькоДней), МЕСЯЦ, 1)
		|	КОНЕЦ КАК ВремяСобытия
		|ПОМЕСТИТЬ РасчетВремениСобытия
		|ИЗ
		|	СрокиОплаты КАК СрокиОплаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РолиПользователей КАК РолиПользователей
		|			ЛЕВОЕ СОЕДИНЕНИЕ Задача.энргЗадачаПИД КАК энргЗадачаПИД
		|			ПО РолиПользователей.Организация = энргЗадачаПИД.Организация
		|				И РолиПользователей.Район = энргЗадачаПИД.Район
		|				И РолиПользователей.Роль = энргЗадачаПИД.Роль
		|				И (энргЗадачаПИД.ЗадачаНапоминание)
		|				И (НЕ энргЗадачаПИД.ПометкаУдаления)
		|				И (энргЗадачаПИД.НапоминаниеЗаСколькоДней = &ЗаСколькоДней)
		|		ПО СрокиОплаты.Организация = РолиПользователей.Организация
		|			И СрокиОплаты.Район = РолиПользователей.Район
		|ГДЕ
		|	СрокиОплаты.СрокОплаты > &ЗаСколькоДней
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетВремениСобытия.Пользователь КАК Пользователь,
		|	РасчетВремениСобытия.Организация КАК Организация,
		|	РасчетВремениСобытия.Район КАК Район,
		|	РасчетВремениСобытия.Роль КАК Роль,
		|	РасчетВремениСобытия.СрокОплаты КАК СрокОплаты,
		|	РасчетВремениСобытия.ЗадачаИсточник КАК ЗадачаИсточник,
		|	РасчетВремениСобытия.ВремяСобытия КАК ВремяСобытия
		|ИЗ
		|	РасчетВремениСобытия КАК РасчетВремениСобытия
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НапоминанияПользователя КАК НапоминанияПользователя
		|		ПО РасчетВремениСобытия.Пользователь = НапоминанияПользователя.Пользователь
		|			И РасчетВремениСобытия.ВремяСобытия = НапоминанияПользователя.ВремяСобытия
		|			И РасчетВремениСобытия.ЗадачаИсточник = НапоминанияПользователя.Источник
		|ГДЕ
		|	НапоминанияПользователя.Пользователь ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	Район";
	
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("РольПользователя",	РольПользователя);
	Запрос.УстановитьПараметр("ЗаСколькоДней",		ЗаСколькоДней);
	Запрос.УстановитьПараметр("ТекДата",			ТекущаяДата());
	
	Если ЗначениеЗаполнено(Район) Тогда
		Запрос.УстановитьПараметр("Район",				Район);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргРолиПользователей.Район = &Район", "Истина");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Район = &Район", "Истина");
	КонецЕсли;
	
	РезультатЗапроса		= Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи	= РезультатЗапроса.Выбрать();
	
	ЗадачаИсточник			= Неопределено;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.СрокОплаты < ЗаСколькоДней Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗадачаИсточник <> ВыборкаДетальныеЗаписи.ЗадачаИсточник Тогда
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ЗадачаИсточник) Тогда
				ЗадачаИсточник = ВыборкаДетальныеЗаписи.ЗадачаИсточник;
			Иначе
				ЗадачаИсточник						= Задачи.энргЗадачаПИД.СоздатьЗадачу();
				ЗадачаИсточник.Дата					= ТекущаяДата();
				ЗадачаИсточник.Наименование			= "Напоминание для уведомления об оплате по району """ + ВыборкаДетальныеЗаписи.Район + """";
				ЗадачаИсточник.Организация			= ВыборкаДетальныеЗаписи.Организация;
				ЗадачаИсточник.Район				= ВыборкаДетальныеЗаписи.Район;
				ЗадачаИсточник.Роль					= ВыборкаДетальныеЗаписи.Роль;
				ЗадачаИсточник.ЗадачаНапоминание	= Истина;
				ЗадачаИсточник.НапоминаниеЗаСколькоДней = ЗаСколькоДней;
				ЗадачаИсточник.Записать();
			КонецЕсли;
		КонецЕсли;
		
		Расписание				= Новый РасписаниеРегламентногоЗадания;
		Расписание.ДеньВМесяце	= День(ВыборкаДетальныеЗаписи.ВремяСобытия);
		Расписание.ПериодНедель	= 1;
		
		ТекущийДень = 1;
		Пока ТекущийДень < 8 Цикл
			Расписание.ДниНедели.Добавить(ТекущийДень);
			ТекущийДень = ТекущийДень + 1;
		КонецЦикла;
		
		ТекущийМесяц = 1;
		Пока ТекущийМесяц < 13 Цикл
			Расписание.Месяцы.Добавить(ТекущийМесяц);
			ТекущийМесяц = ТекущийМесяц + 1;
		КонецЦикла;

		ПараметрыНапоминания	= Новый Структура("Источник,Пользователь,ВремяСобытия,СрокНапоминания,Описание,СпособУстановкиВремениНапоминания,
		|ИнтервалВремениНапоминания,ИмяРеквизитаИсточника,Расписание,ПредставлениеИсточника,Идентификатор", ЗадачаИсточник.Ссылка, ВыборкаДетальныеЗаписи.Пользователь, 
		ВыборкаДетальныеЗаписи.ВремяСобытия, ВыборкаДетальныеЗаписи.ВремяСобытия, ТекстНапоминания, Перечисления.СпособыУстановкиВремениНапоминания.Периодически,0,"",Расписание,"","");
		НапоминанияПользователяСлужебный.ПодключитьНапоминание(ПараметрыНапоминания); 
	КонецЦикла;

	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
